rorke-time/experiment1-sriov-rorke-time/rorke1000-memtier-50k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         4545.46          ---          ---         1.44885         1.67900         3.69500         6.20700       305.77 
Gets        45447.72     17947.63     27500.09         1.44152         1.65500         3.79100         7.26300      2171.76 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      49993.18     17947.63     27500.09         1.44218         1.66300         3.79100         7.10300      2477.53 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.199        5.000
SET       0.271       10.000
SET       0.351       15.000
SET       0.463       20.000
SET       0.727       25.000
SET       1.039       30.000
SET       1.247       35.000
SET       1.391       40.000
SET       1.519       45.000
SET       1.679       50.000
SET       1.759       52.500
SET       1.815       55.000
SET       1.855       57.500
SET       1.887       60.000
SET       1.911       62.500
SET       1.935       65.000
SET       1.959       67.500
SET       1.975       70.000
SET       1.991       72.500
SET       2.007       75.000
SET       2.015       76.250
SET       2.023       77.500
SET       2.031       78.750
SET       2.039       80.000
SET       2.047       81.250
SET       2.063       82.500
SET       2.063       83.750
SET       2.079       85.000
SET       2.095       86.250
SET       2.095       87.500
SET       2.111       88.125
SET       2.111       88.750
SET       2.127       89.375
SET       2.127       90.000
SET       2.143       90.625
SET       2.159       91.250
SET       2.175       91.875
SET       2.175       92.500
SET       2.191       93.125
SET       2.223       93.750
SET       2.239       94.062
SET       2.255       94.375
SET       2.271       94.688
SET       2.287       95.000
SET       2.303       95.312
SET       2.335       95.625
SET       2.383       95.938
SET       2.415       96.250
SET       2.463       96.562
SET       2.543       96.875
SET       2.591       97.031
SET       2.655       97.188
SET       2.751       97.344
SET       2.847       97.500
SET       2.911       97.656
SET       2.975       97.812
SET       3.023       97.969
SET       3.071       98.125
SET       3.135       98.281
SET       3.199       98.438
SET       3.247       98.516
SET       3.295       98.594
SET       3.343       98.672
SET       3.391       98.750
SET       3.455       98.828
SET       3.535       98.906
SET       3.647       98.984
SET       3.807       99.062
SET       3.919       99.141
SET       3.983       99.219
SET       4.031       99.258
SET       4.079       99.297
SET       4.127       99.336
SET       4.191       99.375
SET       4.223       99.414
SET       4.287       99.453
SET       4.319       99.492
SET       4.383       99.531
SET       4.479       99.570
SET       4.607       99.609
SET       4.703       99.629
SET       4.767       99.648
SET       4.895       99.668
SET       4.991       99.688
SET       5.055       99.707
SET       5.151       99.727
SET       5.247       99.746
SET       5.375       99.766
SET       5.471       99.785
SET       5.599       99.805
SET       5.663       99.814
SET       5.727       99.824
SET       5.791       99.834
SET       5.887       99.844
SET       5.951       99.854
SET       6.015       99.863
SET       6.079       99.873
SET       6.143       99.883
SET       6.175       99.893
SET       6.207       99.902
SET       6.207       99.907
SET       6.239       99.912
SET       6.271       99.917
SET       6.303       99.922
SET       6.399       99.927
SET       6.463       99.932
SET       6.463       99.937
SET       6.495       99.941
SET       6.559       99.946
SET       6.655       99.951
SET       6.655       99.954
SET       6.687       99.956
SET       6.687       99.958
SET       6.719       99.961
SET       6.783       99.963
SET       6.847       99.966
SET       6.975       99.968
SET       7.103       99.971
SET       7.167       99.973
SET       7.263       99.976
SET       7.551       99.977
SET       7.615       99.978
SET       7.711       99.979
SET       8.159       99.980
SET       8.191       99.982
SET       8.255       99.983
SET       8.319       99.984
SET       8.319       99.985
SET       8.383       99.987
SET       8.511       99.988
SET       8.639       99.988
SET       8.895       99.989
SET       8.895       99.990
SET       9.215       99.990
SET       9.343       99.991
SET       9.599       99.991
SET       9.791       99.992
SET      10.111       99.993
SET      10.111       99.993
SET      10.239       99.994
SET      10.623       99.994
SET      10.623       99.995
SET      10.623       99.995
SET      10.687       99.995
SET      10.687       99.995
SET      11.071       99.996
SET      11.071       99.996
SET      11.199       99.996
SET      11.199       99.997
SET      11.199       99.997
SET      11.519       99.997
SET      11.519       99.997
SET      11.519       99.997
SET      11.519       99.998
SET      11.519       99.998
SET      11.519       99.998
[...]
SET      11.967       99.999
SET      11.967       99.999
SET      11.967       99.999
[...]
SET      12.415       99.999
SET      12.415      100.000
---
GET       0.039        0.000
GET       0.191        5.000
GET       0.263       10.000
GET       0.335       15.000
GET       0.447       20.000
GET       0.703       25.000
GET       1.015       30.000
GET       1.223       35.000
GET       1.375       40.000
GET       1.503       45.000
GET       1.655       50.000
GET       1.743       52.500
GET       1.807       55.000
GET       1.855       57.500
GET       1.887       60.000
GET       1.911       62.500
GET       1.935       65.000
GET       1.951       67.500
GET       1.975       70.000
GET       1.991       72.500
GET       1.999       75.000
GET       2.007       76.250
GET       2.015       77.500
GET       2.023       78.750
GET       2.031       80.000
GET       2.039       81.250
GET       2.047       82.500
GET       2.063       83.750
GET       2.079       85.000
GET       2.079       86.250
GET       2.095       87.500
GET       2.095       88.125
GET       2.111       88.750
GET       2.111       89.375
GET       2.127       90.000
GET       2.143       90.625
GET       2.143       91.250
GET       2.159       91.875
GET       2.175       92.500
GET       2.191       93.125
GET       2.207       93.750
GET       2.223       94.062
GET       2.239       94.375
GET       2.255       94.688
GET       2.271       95.000
GET       2.287       95.312
GET       2.319       95.625
GET       2.335       95.938
GET       2.367       96.250
GET       2.415       96.562
GET       2.463       96.875
GET       2.511       97.031
GET       2.543       97.188
GET       2.591       97.344
GET       2.671       97.500
GET       2.783       97.656
GET       2.895       97.812
GET       2.975       97.969
GET       3.039       98.125
GET       3.103       98.281
GET       3.183       98.438
GET       3.231       98.516
GET       3.279       98.594
GET       3.343       98.672
GET       3.407       98.750
GET       3.487       98.828
GET       3.599       98.906
GET       3.759       98.984
GET       3.903       99.062
GET       4.015       99.141
GET       4.127       99.219
GET       4.159       99.258
GET       4.223       99.297
GET       4.287       99.336
GET       4.351       99.375
GET       4.447       99.414
GET       4.575       99.453
GET       4.799       99.492
GET       4.991       99.531
GET       5.151       99.570
GET       5.343       99.609
GET       5.439       99.629
GET       5.503       99.648
GET       5.599       99.668
GET       5.695       99.688
GET       5.791       99.707
GET       5.887       99.727
GET       5.951       99.746
GET       6.047       99.766
GET       6.111       99.785
GET       6.207       99.805
GET       6.239       99.814
GET       6.271       99.824
GET       6.335       99.834
GET       6.431       99.844
GET       6.527       99.854
GET       6.623       99.863
GET       6.751       99.873
GET       6.911       99.883
GET       7.103       99.893
GET       7.327       99.902
GET       7.423       99.907
GET       7.551       99.912
GET       7.647       99.917
GET       7.743       99.922
GET       7.903       99.927
GET       8.031       99.932
GET       8.127       99.937
GET       8.255       99.941
GET       8.319       99.946
GET       8.447       99.951
GET       8.575       99.954
GET       8.703       99.956
GET       8.831       99.958
GET       9.023       99.961
GET       9.215       99.963
GET       9.343       99.966
GET       9.535       99.968
GET       9.663       99.971
GET       9.855       99.973
GET       9.983       99.976
GET       9.983       99.977
GET      10.111       99.978
GET      10.175       99.979
GET      10.239       99.980
GET      10.303       99.982
GET      10.431       99.983
GET      10.495       99.984
GET      10.559       99.985
GET      10.687       99.987
GET      10.815       99.988
GET      10.879       99.988
GET      10.943       99.989
GET      10.943       99.990
GET      11.007       99.990
GET      11.071       99.991
GET      11.135       99.991
GET      11.199       99.992
GET      11.263       99.993
GET      11.327       99.993
GET      11.391       99.994
GET      11.391       99.994
GET      11.455       99.995
GET      11.519       99.995
GET      11.519       99.995
GET      11.583       99.995
GET      11.647       99.996
GET      11.711       99.996
GET      11.775       99.996
GET      11.839       99.997
GET      11.967       99.997
GET      11.967       99.997
GET      11.967       99.997
[...]
GET      11.967       99.998
GET      12.031       99.998
GET      12.095       99.998
GET      12.095       99.998
GET      12.159       99.998
GET      12.159       99.998
GET      12.223       99.998
GET      12.223       99.999
GET      12.223       99.999
GET      12.287       99.999
GET      12.287       99.999
GET      12.351       99.999
GET      12.351       99.999
GET      12.415       99.999
GET      12.479       99.999
GET      12.479       99.999
GET      12.543       99.999
GET      12.543       99.999
GET      12.543       99.999
[...]
GET      12.543      100.000
GET      12.543      100.000
GET      12.607      100.000
GET      12.607      100.000
GET      12.671      100.000
GET      12.671      100.000
GET      12.671      100.000
[...]
GET      12.799      100.000
GET      12.799      100.000
GET      12.799      100.000
[...]
GET      12.863      100.000
GET      12.863      100.000
GET      12.863      100.000
[...]
GET      13.183      100.000
GET      13.183      100.000
---
WAIT      0.000      100.000